In [35]:
import pandas as pd
import numpy as np

### Join

In [31]:
df = pd.DataFrame({'userid': ['K10', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'name': ['A10', 'A1', 'A2', 'A3', 'A4', 'A5'],
                   'citizenid': ['C10', 'C1', 'C2', 'C3', 'C4', 'C5']})
df

  userid name citizenid
0    K10  A10       C10
1     K1   A1        C1
2     K2   A2        C2
3     K3   A3        C3
4     K4   A4        C4
5     K5   A5        C5

In [32]:
other = pd.DataFrame({'userid': ['K0', 'K1', 'K2'],'bank': ['B0', 'B1', 'B2'],'citizenid': ['C0', 'C1', 'C2']})
other

  userid bank citizenid
0     K0   B0        C0
1     K1   B1        C1
2     K2   B2        C2

In [33]:
df.join(other.set_index(['userid','citizenid']), on = ['userid','citizenid'], how = 'inner', rsuffix='_bank')

  userid name citizenid bank
1     K1   A1        C1   B1
2     K2   A2        C2   B2

### Merge

In [30]:
df.merge(other, left_on = ['userid'],right_on = ['customerid'], how= 'inner', suffixes = ['','_bank'])

  userid name citizenid customerid bank citizenid_bank
0     K1   A1        C1         K1   B1             C1
1     K2   A2        C2         K2   B2             C2